dc = {'허정도': 234, "홍길동": 12, "허정도": 12}  # 키중복 안됨.

print(dc)
print(dc['허정도'])
dc['허정도'] = 4444
print(dc['허정도'])
print(dc)
dc['김순희'] = 343  # 데이터 추가
print(dc)
del dc['홍길동']  # 데이터 삭제
print(dc)

print("====================================================")

t1 = [1, 2, 4]
t2 = [1, 2, 4]
t3 = [4, 2, 1]

print(t1 == t2)
print(t1 == t3)

print("====================================================")

dc1 = {'허정도': 234, "홍길동": 12, "이순신": 432}
dc2 = {'허정도': 234, "홍길동": 12, "이순신": 432}
dc3 = {"이순신": 432, '허정도': 234, "홍길동": 12}

# 딕셔너리는 저장순서를 유지하지 않는다.
print(dc1 == dc2)
print(dc1 == dc3)

print("================== 디셔너리의 in 연산 예시 ========================")

if '허정도' in dc1:
    print("있음")
    dc1['강감찬'] = 121  # 추가되는데 여기선 수정을 권장, 있으면 수정
    dc1['허정도'] = 21211
else:
    print("없음")

print("================== 디셔너리의 not-in 연산 예시 ========================")

if '강감찬' not in dc1:
    print("없음")  # 여기서 추가를 권장, 없으면 추가
else:
    print("있음")

print(dc1)

print("====================================================")

for i in dc1:  # 키가 넘어간다. 루프 순서를 보장하지 않음을 주의
    print(i, end="\n")
    dc1[i] += 40

print(dc1)
